package by.epam.l02.homework;

/*Выведите на экран следующий текст.*/

public class HW03text
{
	final static String text =	
	"Пройдет много лет, и полковник Аурелиано Буэндиа, стоя у стены в ожидании расстрела,\n"+
	"вспомнит тот далекий вечер, когда отец взял его с собой посмотреть на лед. Макондо было\n"+
	"тогда небольшим селением с двумя десятками хижин, выстроенных из глины и бамбука на\n"+
	"берегу реки, которая мчала свои прозрачные воды …	";
	
	
	public static void main(String[] args)
	{	
	System.out.println(text);
	}
}
